// 抽检类别
export const cate = ['原材料', '路基工程', '路面工程', '桥梁工程', '交安工程'];

//

export const project = [
  [
    '粗集料（组）',
    '细集料（组）',
    '水泥（组）',
    '钢筋原材（组）',
    '钢筋焊接（组）',
    '沥青（组）',
    '粉煤灰（组）',
    '减水剂（组）',
    '矿料级配（组）',
    '矿粉（组）',
    '锚夹具（组）',
    '橡胶支座（组）',
    '钢绞线（组）',
  ],
  ['水泥混凝土强度（组）', '弯沉（点）', '压实度（点）', '地基承载力（点）', '回弹测强（测区）'],
  [
    '砂浆强度（组）',
    '水泥混凝土强度（组）',
    '垫层压实度（点）',
    '垫层弯沉（点）',
    '水稳压实度（点）',
    '水稳弯沉（点）',
    '水稳层厚度（点）',
    '沥青混合料（组）',
    '基层芯样强度（点）',
    '碎石化指标（组）',
    '沥青路面压实度（点）',
    '沥青路面厚度（点）',
    '沥青路面弯沉（点）',
    '平整度（处）',
    '无侧限抗压（组）',
  ],
  [
    '主拱圈注浆（点）',
    '超声回弹（测区）',
    '锚杆拉拔（组）',
    '混凝土强度（组）',
    '墩台竖直度（根）',
    '墩柱结构尺寸（点）',
    '梁板几何尺寸（点）',
    '桩基完整性（根）',
    '钢筋保护层厚度（点）',
  ],
  ['波形护栏（套）'],
];

// 施工现场管理
// 管理日志

export const logsCate = ['安全基础管理类', '施工现场安全管理类', '质量控制类'];

export const logsCateChild = [
  [
    '安全生产管理制度',
    '安全专项工作',
    '安管人员持证上岗类',
    '安全生产费用类',
    '机械设备类',
    '安全交底、教育培训类',
    '应急管理类',
    '汛期安全类',
    '隐患排查类',
    '其他',
  ],
  [
    '安全防护类',
    '警示标志类',
    '施工驻地类',
    '机械设备类',
    '消防安全类',
    '临时用电类',
    '隧道施工类',
    '高空作业类',
    '施工现场安全管理类',
    '支架、脚手架及模板',
    '其他',
  ],
  ['质量管理体系', '分部分项工程报验签发', '施工自检', '监理抽检', '工程外观或结构尺寸', '其他'],
];

export const logsDutyUnit = ['建设单位', '施工单位', '监理单位'];

export const logsRectifySituation = ['已完成整改', '未完成整改'];
